#1 Арифметичні операції:
# Написати програму, яка зчитує два числа та виводить їхню суму, різницю, добуток та частку.
Num1 = 8
Num2 = 4

print(Num1+Num2)
print(Num1-Num2)
print(Num1*Num2)
print(type(Num1//Num2), Num1/Num2)
print(type(Num1/Num2), Num1//Num2)
# Решил использовать как / так и //


# 2 Залишок від ділення:
# Користувач вводить два числа. Вивести залишок від ділення першого числа на друге.

Num1 = int(input("Введіть перше число: "))
Num2 = int(input("Введіть друге число: "))

result = Num1/Num2
print(result)

# 3 Цілочисельне ділення:
# Користувач вводить два числа. Вивести, скільки разів перше число ділиться на друге без залишку.

Num1 = int(input("Введіть перше число: "))
Num2 = int(input("Введіть друге число: "))

result = Num1//Num2
print(result)

# 4 Перетворення стрічки у число:
# Користувач вводить рядок, який складається з цифр. Програма повинна перетворити його на число та вивести.

Number = input("Введіть число: ")
print(type(int(Number)), Number)

# 5 Стрічкова конкатенація + математика:
# Користувач вводить два числа. Програма повинна вивести два прінти: перший — їхню суму,
# другий об'єднати їх. Якщо в нас числа 5 та 4, то результат повинен бути 9 та 54.


Num1 = (input("Введіть перше число: "))
Num2 = (input("Введіть друге число: "))

print(int(Num1)+int(Num2))
print(Num1+Num2)
